[
  {
    "title": "Jejak Petualang",
    "description": "Aplikasi e-commerce full-stack untuk peralatan outdoor, lengkap dengan panel admin dan manajemen transaksi.",
    "category": "fullstack",
    "imageUrl": "../assets/img/projects/id/jejakpetualang.jpg",
    "githubUrl": "https://github.com/sulujulianto/jejakpetualang",
    "liveUrl": "",
    "techStack": ["PHP Native", "MySQL", "JavaScript", "HTML5", "CSS3"],
    "dateAdded": "2025-08-20",
    "modalDescription": "Membangun sistem toko online dari nol menggunakan PHP Native untuk memahami logika dasar backend tanpa bantuan framework. Fitur mencakup alur belanja lengkap (Keranjang, Checkout, Riwayat Pesanan) untuk pelanggan, serta Dashboard Admin yang kompleks untuk mengelola produk, stok, kategori, promo voucher, dan memvalidasi status pesanan pengguna.",
    "isFeatured": true
  },
  {
    "title": "Nusantara Trans",
    "description": "Platform pemesanan tiket bus end-to-end dengan fitur pemilihan kursi visual real-time dan dashboard admin lengkap, dibangun menggunakan PHP Native.",
    "category": "fullstack",
    "imageUrl": "../assets/img/projects/id/nusantaratrans.jpg",
    "githubUrl": "https://github.com/sulujulianto/nusantaratrans",
    "liveUrl": "",
    "techStack": ["PHP 8", "MySQL", "Bootstrap 5", "JavaScript", "PDO", "CSS3"],
    "dateAdded": "2025-11-19",
    "modalDescription": "NusantaraTrans adalah aplikasi full-stack untuk reservasi tiket bus rute Kalimantan & IKN. Fitur utamanya mencakup pemilihan kursi interaktif (denah visual), sistem keranjang dengan penguncian kursi sementara, dan alur checkout yang aman (CSRF protection). Dilengkapi panel admin komprehensif untuk manajemen armada, pengaturan rute dinamis, approval refund, serta laporan pendapatan.",
    "isFeatured": true
  },
  {
    "title": "Japan Travel",
    "description": "Platform wisata Jepang all in one. Menggabungkan katalog destinasi, toko oleh-oleh online, dan sistem ulasan pengunjung dalam satu aplikasi.",
    "category": "fullstack",
    "imageUrl": "../assets/img/projects/id/japanese-travel.jpg",
    "githubUrl": "https://github.com/sulujulianto/japanesetravel",
    "liveUrl": "",
    "techStack": ["Laravel 12", "Tailwind CSS", "Alpine.js", "MySQL", "Vite"],
    "dateAdded": "2025-11-20",
    "modalDescription": "Aplikasi web modern yang dibangun menggunakan Laravel 12. Fiturnya sudah sangat lengkap: mendukung multi-bahasa (Indonesia/Inggris), tema gelap/terang (dark mode), serta sistem role untuk User dan Admin. Admin memiliki dashboard statistik untuk memantau pendapatan dan stok souvenir, sementara pengguna bisa merencanakan perjalanan sekaligus belanja oleh-oleh.",
    "isFeatured": true
  }
]